[
    {
        "city": "Tijuana",
        "company": "Eaton Corporation",
        "country": "Mexico",
        "country_short": "MEX",
        "date_new": "2014-07-09 23:21:05",
        "description": "** Job Description**\nAble to confer with Design Engineering on manufacturability and testability of new products and bring new products into Manufacturing:\na. Ability to understand molding, machining, & stamping design concepts and be able to interact with Design Engineers in technical discussions around these processes.\nb. Ability to tailor process development around expected volume and duration of the product.\nc. Possesses a good understanding of geometric dimensioning and tolerance usage.\nd. Familiarity with New Product Introduction project management systems.\ne. Capable of estimating costing on new products at various stages of Design completion.\nf. Evaluates/Selects tooling and equipment supplies. Writes capital justification requests.\nDevelops, evaluates and improve manufacturing methods, including tooling, fixtures and processes.\nAnalyzes and plans, space requirements, workflow and designs layout of equipment for maximum efficiency.\nConfers with material planner to assure identification of unique, long lead time, special handling or high cost items to assure appropriate measures will be taken prior to production start up.\nDevelops and analyzed statistical data and product/process performance to recommend and implement improvements in targeted areas\nConfers with management, engineering and other staff regarding manufacturing capabilities, production schedules and other considerations to facilitate production processes.\nDevelops, implements, and audits inspection and test plans, standards and acceptance criteria, and procedures/work instructions.\n\n** Basic Qualifications (Including Educational Requirements)**\n1 to 3 years of experience in a similar position\nBilingual English/ Spanish (preferred)\nGood communication skills\nComputer Skills\nStrong project management skills\nUnderstanding of problem solving methods (Six Sigma, 8D, root cause analysis)\nKnowledge of industry and customer specific quality registration schemes and certification processes (ISO9001, AS9100)\nKnowledge of process auditing techniques to ensure compliance to defined quality requirements\nDetail Oriented\nBachelor’s degree in Engineering.\nGreen belt certified is a plus\n\n\n*Req Number:* 74503BR\n\n\n*Division:* Fluid and Electrical Distribution\n\n\n*Function:* Manufacturing",
        "guid": "59D6C80902EC4FC88EF01BADBB990FBB",
        "location": "Tijuana, MD",
        "reqid": "74503BR",
        "state": null,
        "state_short": null,
        "title": "Manufacturing Engineer",
        "uid": null,
        "url": "http://eaton-veterans.jobs/59D6C80902EC4FC88EF01BADBB990FBB24"
    },
    {
        "city": "Nanterre",
        "company": "Eaton Corporation",
        "country": "France",
        "country_short": "FRA",
        "date_new": "2014-07-09 23:21:05",
        "description": "** Job Description**\n2. MISSION DE LA FONCTION\n\n\n* Assurer le développement de l''activité auprès des clients connus, et identifier les potentiels nouveaux.\n\n\n* Produire des prévisions de chiffre d’affaires à court et moyen terme.\n\nINVENTAIRE DES ATTRIBUTIONS\n\n\n\n* Elaborer des propositions de contrat de maintenance selon le tarif en vigueur.\n\n\n* Assurer une présence soutenue chez les clients et prospects, en particulier pour l''implantation de nouveaux services.\n\n\n* S''assurer que toutes les exigences du contrat sont définies, documentées et acceptées par les deux parties. Valider la solvabilité des clients.\n\n\n* Recueillir et transmettre toutes les informations susceptibles d''orienter les services concernés pour le développement de nouveaux produits ou services.\n\n\n* Justifier les écarts entre prévisions et réalisations, et prendre les actions correctives.\n\n\n* Optimiser les déplacements (temps, trajets, coûts).\n\n\n* S’assurer de disposer des moyens nécessaires (outils, manuels, logiciels, …) pour effectuer sa mission.\n\n** Basic Qualifications (Including Educational Requirements)**\nFormation:\nBTS Electrotechnique / BTS Electronique\nExpérience: 5 à 8 ans d’expérience dans des fonctions similaires\nLangues Anglais – Niveau intermédiaire\nAutre\n\n\n*Req Number:* 74739BR\n\n\n*Division:* EMEA Sales\n\n\n*Function:* Marketing and Sales",
        "guid": "E48345D53CF44992AFF406CFFFF2BB42",
        "location": "Nanterre, TX",
        "reqid": "74739BR",
        "state": null,
        "state_short": null,
        "title": "Service Sales Engineer",
        "uid": null,
        "url": "http://eaton-veterans.jobs/E48345D53CF44992AFF406CFFFF2BB4224"
    },
    {
        "city": "Glendale Heights",
        "company": "Eaton Corporation",
        "country": "United States",
        "country_short": "USA",
        "date_new": "2014-07-09 23:21:04",
        "description": "** Job Description**\nEaton Electrical Sector’s Customer Manufacturing Solution Centers (CMSC) operation is seeking highly promotable, talented individuals to be part of our elite all-salaried workforce.\n\nCurrently, there is an exciting new opening for a Production Technician located at our Glendale Heights, IL facility.\n\nThis position supports the CMSC Operation - a complex growing operation with approximately $315 million in sales, 400+ employees in 18 remote plants in the United States. If you have a strong work ethic, a desire to be part of a world-class organization, and the ability to work well in a team environment, we would like to speak with you.\n\nJob responsibilities may include: assemble, fit and mount sub-assemblies, components, and standard fixed assemblies in electrical control equipment. Perform assembly required for test preparation and final inspection. Use established power checking procedures and equipment to verify electrical/mechanical integrity of units assembled. Stage parts for customer orders.\n\nIn return, we offer a competitive salary package based on skills and experience, and a comprehensive fringe benefits program including 401k, medical, dental, tuition reimbursement, vacation, along with excellent working conditions. You will be eligible for benefits coverage on your first day of employment.\n\nCome Join a Winning Team!!! Eaton Corporation is an Affirmative Action/EEO Employer M/F/V/D.\n\n** Basic Qualifications (Including Educational Requirements)**\nBASIC QUALIFICATIONS:\n\n\n* High School Diploma or G.E.D. required from an accredited institution\n\n\n* Minimum of 1 year experience working in a manufacturing setting or completion of an electrical vocational school training program (minimum 9 months)\n\n\n* Legally authorized to work in the United States without company sponsorship\n\n\n* At this time, relocation assistance is not available for this position. Only candidates in the immediate geographic area (50 mile radius) will be considered.\n\nADDITIONAL PREFFERED QUALIFICATIONS:\n\n\n* Experience using various tools, including: Manual/electric/pneumatic tools, fork truck, jib crane, template/fixtures, hand carts, measuring and testing equipment, storage/packaging materials and prescribed safety equipment.\n\n\n* Good record of job performance, safety, and attendance.\n\n\n* Good understanding of blue print/schematics, and wiring experience.\n\n\n* Experience in reading control drawings and working with electrical equipment.\n\nPHYSICAL DEMANDS: While performing the duties of this job the employee is regularly required to stand, walk, stoop, squat, reach to or below shoulder level, lift, carry, push, pull, and use hands to handle and feel. The employee is frequently required to climb and reach above shoulder level. The employee is regularly required to lift/carry up to 50 pounds. The employee is frequently required to push/pull up to 50 pounds. The employee is occasionally required to push/pull greater than 50 pounds with assistance.\n\n\n*Req Number:* 75204BR\n\n\n*Division:* ESSG - Commercial Distribution Products and Assemblies Division\n\n\n*Function:* Manufacturing",
        "guid": "C4677B65BBEB47B7AF7923DBCDC81B38",
        "location": "Glendale Heights, IL",
        "reqid": "75204BR",
        "state": "Illinois",
        "state_short": "IL",
        "title": "Production Technician - Glendale Heights, IL",
        "uid": null,
        "url": "http://eaton-veterans.jobs/C4677B65BBEB47B7AF7923DBCDC81B3824"
    }
]
